Llerr/Clock-on-STM32/Core/Src/Screens.c
#include <stdio.h>

#include "stm32_ub_font.h"
#include "MatrixRGB.h"
#include "sensors.h"
#include "buttons.h"
#include "rtc.h"
#include "backup.h"
#include "utils.h"

#include "Screens.h"
#include "pictures.h"

#define NUM_MAIN_SCREENS 4

int curBright = 255; ///< Текущая яркость
uint8_t useCountdown = 0;
uint8_t counterForScreens = 0; ///< счётчик для перехода к следующему экрану
uint8_t resetCounter = 0;      ///< Счётчик для перехода к начальному режиму (Отображение времени)

//int menu = 0;  ///<  Пункт меню
char editMode = 0; ///< Флаг редактирования
char editText[32] = {0};
char editTextDays[32] = {0};
char editTextOffDays[32] = {0};
char editTextAlarmOn[32] = {0};
char blinkText[32] = {0};

ScreenDescript *screenCur = NULL;
ScreenDescript *screenPrev = NULL;

char *weekText[]=
{
    "    Sunday ",
    "    Monday ",
    "  Tuesday ",
    "Wednesday",
    "  Thursday",
    "    Friday ",
    "   Saturday",
};


//Понедельник - Monday - Mon или Mo
//Вторник - Tuesday - Tue или Tu
//Среда - Wednesday - Wed или We
//Четверг - Thursday - Thu или Th
//Пятница - Friday - Fri или Fr
//Суббота - Saturday - Sat или Sa
//Воскресенье - Sunday - Sun или Su


char *menuText[] =
{
    "Time        ",
    "Date        ",
    "Alarms >    ",
    "Brightness >"
};

//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
void drawScreen()
{
  if(!screenCur)
    return;
  //  clearMatrix();
  for(int i = 0; i < screenCur->numText; ++i)
  {
    screenCur->text[i]->draw(screenCur->text[i], NULL);
  }
  //  blink(0); // перересуем соответствующим цветом, то что должно мигать
}

//----------------------------------------------------------------------------------------------------------------------
void screenSecondCallback()
{
  if(useCountdown)
  {
    if(decreaseTime(&sCountdown))
    {
      clearScreen();
      screenCur = &screenCountdownFinish;
      useCountdown = 0;
    }

    return; // Дальше можно ничего не делать
  }

  if(counterForScreens > 3)
  {
    counterForScreens = 0;
    nextScreenMode();
  }
  ++counterForScreens;
  checkAlarms();

}

//----------------------------------------------------------------------------------------------------------------------
void clearScreen()
{
  clearMatrix();
}

//----------------------------------------------------------------------------------------------------------------------
void nextScreenMode()
{
  //  printf("Next main screen: cur: %p, next: %p\n", screenCur, screenCur->nextMode);
//  static uint8_t resetCounter = 0;
  switch(screenCur->type)
  {
  // В основном режиме, листаем показания
  case stateTime:
    screenCur = screenCur->nextMode;
    break;
  // В режимах редактирования, ничего не делаем, а так же в экранах будильника
  case stateClock:
  case stateSleep:
  case stateAlarmEdit:
  case stateBrightnessEdit:
  case stateCountDownFinish:
  case stateCountDownEdit:
  case stateDateEdtit:
  case stateTimeEdit:
    break;
  // По умолчанию, возвращаемся к показу времени
  default:
    if(++resetCounter > 3)
    {
      clearScreen();
      resetCounter = 0;
      screenCur = &screenMain1;
    }
    break;
  }
}

//----------------------------------------------------------------------------------------------------------------------
void blink(uint8_t change)
{
  if(!screenCur->blink) // Если нет мигания
    return;
  static uint8_t blinkStep = 0;
  static uint8_t color;
  if(change)
  {
    color = (!blinkStep)?screenCur->blink->colorFont:screenCur->blink->colorBack;
    blinkStep = !blinkStep;
  }
  //  screenCur->blink->colorFont = color;
//    printf("%lu: Blink, color( %d ) \n", HAL_GetTick(), color);
  screenCur->blink->draw(screenCur->blink, &color);
}


//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
void sleepOn()
{
  printf("Sleep On\n");
  screenCur = &screenSleep; // Переключимся на экран сна
  alarmSetState(&alarmSleep, 1); //включим сон
}

//----------------------------------------------------------------------------------------------------------------------
void alarmOff()
{
  printf("Alarm Off\n");
  screenCur = &screenMain1; // Переключимся на основное время
  alarmSetState(&alarmSleep, 0); //отключим сон
}

//----------------------------------------------------------------------------------------------------------------------
#define SLEEP_TIME (10*1)
void alarmOn(Alarm *alrm)
{
  printf("Alarm On\n");
  screenCur = &screenClock;
  alarmSleep.alarmTime = alrm->alarmTime;
  addTime(&alarmSleep.alarmTime, SLEEP_TIME);
  clearScreen();
}

//----------------------------------------------------------------------------------------------------------------------
void checkAlarms()
{
  if(alaramIsOn(&alarm1))
  {
    alarmOn(&alarm1);
  }
  if(alaramIsOn(&alarm2))
  {
    alarmOn(&alarm2);
  }
  if(alaramIsOn(&alarm3))
  {
    alarmOn(&alarm3);
  }
  if(alaramIsOn(&alarmSleep))
  {
    alarmOn(&alarmSleep);
  }
}

//----------------------------------------------------------------------------------------------------------------------
void setBrightness()
{

}

//----------------------------------------------------------------------------------------------------------------------
void initScreens()
{
  screenCur = &screenMain1;

  //   printf("screenMain1: %p\n", &screenMain1);
  //   printf("screenMain2: %p\n", &screenMain2);
  //   printf("screenMain3: %p\n", &screenMain3);
  //   printf("screenMain4: %p\n", &screenMain4);
}

//----------------------------------------------------------------------------------------------------------------------
//---------------------------- Нажатие средней кнопки ------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
void saveTime(void *dataPtr)
{
  setTime(&sTimeEdit);
  screenCur = &screenMenuTime;
}

//----------------------------------------------------------------------------------------------------------------------
void saveDate(void *dataPtr)
{
  checkDate(&sDateEdit);
  setDate(&sDateEdit);
  getDate(&sDate);
  saveDateBKP(&sDateEdit);
  screenCur = &screenMenuDate;
}

//----------------------------------------------------------------------------------------------------------------------
void saveAlarm(void *dataPtr)
{
  switch (screenCur->backState->type)
  {
    case stateMenuAlarm1:
      alarm1 = alarmEdit;
      break;
    case stateMenuAlarm2:
      alarm2 = alarmEdit;
      break;
    case stateMenuAlarm3:
      alarm3 = alarmEdit;
      break;
    default:
      break;
  }

