Llerr/Clock-on-STM32/Core/Src/Screens.c
  saveAlarmsBKP();
  screenCur = screenCur->backState;
}

//----------------------------------------------------------------------------------------------------------------------
void inBrightness(void *dataPtr) ///< Вход в редактирование яркости
{
  clearMatrix();
  screenBrightnessEdit.backState = screenCur;
  screenCur = &screenBrightnessEdit;

  GPIO_Press_Pin = 0;
  buttonReceiverBrightEdit();
}

//----------------------------------------------------------------------------------------------------------------------
void inCountdownEdit(void *dataPtr) ///< Вход в редактирование яркости
{
  clearMatrix();
  screenCountdownEdit.backState = screenCur;
  screenCur = &screenCountdownEdit;

  GPIO_Press_Pin = 0;
  buttonReceiverCountdownEdit();
}

//----------------------------------------------------------------------------------------------------------------------
void countdownStartStop(void *dataPtr)
{
  if(timeIsZero(&sCountdown)) // Если не установлен счётчик, то ничего не включаем.
  {
//    sCountdown = sCountdownEdit;
    useCountdown = 0;
    return;
  }

  useCountdown = !useCountdown;
  printf("Save count (%02d:%02d:%02d), start: %d\n", sCountdown.Hours, sCountdown.Minutes, sCountdown.Seconds, useCountdown);
}

//----------------------------------------------------------------------------------------------------------------------
void countdownFinish(void *dataPtr)
{
  screenCur = &screenCountdown;
  sCountdown = sCountdownEdit;
}

//----------------------------------------------------------------------------------------------------------------------
void saveCountdown(void *dataPtr)
{
  screenCur = screenCur->backState;
  sCountdown = sCountdownEdit;
  clearScreen();
}

//----------------------------------------------------------------------------------------------------------------------
void saveBrightness(void *dataPtr)
{
  screenCur = screenCur->backState;
  clearScreen();
}

//----------------------------------------------------------------------------------------------------------------------
void midStub(void *dataPtr) ///< Заглушка
{
}

//----------------------------------------------------------------------------------------------------------------------
void selectMenuTime(void *dataPtr) ///< Редактрование текущего времени (выбор в меню)
{
  screenCur = &screenEditTime;
  clearScreen();
  GPIO_Press_Pin = 0;
  getTime(&sTimeEdit);
  sTimeEdit.Seconds = 0;
  buttonReceiverTimeEdit();
}

//----------------------------------------------------------------------------------------------------------------------
void selectMenuAlarm(void *dataPtr) ///< Редактрование текущего времени (выбор в меню)
{
  screenEditAlarm.backState = screenCur;
  screenCur = &screenEditAlarm;
  switch (screenCur->backState->type)
  {
    case stateMenuAlarm1:
      alarmEdit = alarm1;
      break;
    case stateMenuAlarm2:
      alarmEdit = alarm2;
      break;
    case stateMenuAlarm3:
      alarmEdit = alarm3;
      break;
    default:
      break;
  }
  clearScreen();
  GPIO_Press_Pin = 0;
//  getTime(&sTimeEdit);
//  sTimeEdit.Seconds = 0;
  buttonReceiverAlarmEdit();
}

//----------------------------------------------------------------------------------------------------------------------
void selectMenuDate(void *dataPtr) ///< Редактрование текущего времени (выбор в меню)
{
  screenCur = &screenEditDate;
  clearScreen();
  GPIO_Press_Pin = 0;
  getDate(&sDateEdit);
  buttonReceiverDateEdit();
}

//----------------------------------------------------------------------------------------------------------------------
void showMenu(void *dataPtr)
{
//  menu = 0;
  screenCur = &screenMenuTime;
}

//----------------------------------------------------------------------------------------------------------------------
void timerStartStop(void *dataPtr)
{

}

//----------------------------------------------------------------------------------------------------------------------
//--------------------------------- Отрисовка текста -------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
void drawHour(TextSets *set, void *dataPtr)          // 4 для вывода времени
{
  char buff[32];
  sprintf(buff, "%02d", sTime.Hours);
  UB_Font_DrawPString16(set->x, set->y, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawMinute(TextSets *set, void *dataPtr)          // 4 для вывода времени
{
  char buff[32];
  sprintf(buff, "%02d", sTime.Minutes);
  UB_Font_DrawPString16(set->x, set->y, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawBellOn(TextSets *set, void *dataPtr)
{
  if(alarmOnCount)
    drawPicture(set->x, set->y, &picBell);
}

//----------------------------------------------------------------------------------------------------------------------
void drawDateAdd(TextSets *set, void *dataPtr)          // 5 для вывода даты
{
  char buff[32];
  sprintf(buff, "   %02d.%02d.%02d   ", sDate.Date, sDate.Month, sDate.Year);
//  drawPicture(set->x, set->y, &picCalendar);
  UB_Font_DrawPString16(set->x /*+ picCalendar.width*/, set->y+2, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawTemperature(TextSets *set, void *dataPtr)
{
  char buff[32];
  if (temperature > -300)
    sprintf(buff, " %d.%d`C      ", temperature / 100, temperature % 100);
  else
    sprintf(buff, " --.--`C        ");
  drawPicture(set->x, set->y, &picTemperature);
  UB_Font_DrawPString16(set->x + picTemperature.width, set->y + 2, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawHumidity(TextSets *set, void *dataPtr)
{
  char buff[32];
  if(humidity > 0)
    sprintf(buff, " %d.%d%%    ", humidity/100, humidity%100);
  else
    sprintf(buff, " --.--%%     ");
  drawPicture(set->x, set->y, &picHumidity);
  UB_Font_DrawPString16(set->x + picHumidity.width, set->y+2, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawPressure(TextSets *set, void *dataPtr)      // 3 для вывода давления
{
  char buff[32];
  if(pressure > 0)
    sprintf(buff, " %dmm    ", pressure/100);
  else
    sprintf(buff, " ---mm     ");
  drawPicture(set->x, set->y, &picPressure);
  UB_Font_DrawPString16(set->x + picPressure.width, set->y+2, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawClock(TextSets *set, void *dataPtr)
{
  drawPicture(set->x, set->y, &picClock);
}

//----------------------------------------------------------------------------------------------------------------------
void drawSleep(TextSets *set, void *dataPtr)
{
  drawPicture(set->x, set->y, &picSleep);
}

//----------------------------------------------------------------------------------------------------------------------
void drawDate(TextSets *set, void *dataPtr)          // 5 для вывода даты
{
  char buff[32];
  sprintf(buff, "%02d.%02d.%02d", sDate.Date, sDate.Month, sDate.Year);
  UB_Font_DrawPString32(set->x, set->y, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawWeekDay(TextSets *set, void *dataPtr)
{
  char buff[32];
  sprintf(buff, "%s ", weekText[sDate.WeekDay]);
  set->colorFont = ((sDate.WeekDay  == RTC_WEEKDAY_SATURDAY) || (sDate.WeekDay == RTC_WEEKDAY_SUNDAY))?RED:GREEN;
  UB_Font_DrawPString16(set->x, set->y, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawAlarm(TextSets *set, void *dataPtr)         // 6 для вывода будильниика
{
  char buff[32];
  Alarm *cur;
  switch(screenCur->type)
  {
  case stateMenuAlarm1:
    cur = &alarm1;
    drawPicture(60, 0, &picNum1);
    break;
  case stateMenuAlarm2:
    cur = &alarm2;
    drawPicture(60, 0, &picNum2);
    break;
  case stateMenuAlarm3:
    cur = &alarm3;
    drawPicture(60, 0, &picNum3);
    break;
  default:
    break;
  }
  drawPicture(57, 5, &picBell);
  sprintf(buff, "%02d:%02d", cur->alarmTime.Hours, cur->alarmTime.Minutes);
  UB_Font_DrawPString16(set->x, set->y, buff, set->font, set->colorFont, set->colorBack);

  drawBars(cur);
}

//----------------------------------------------------------------------------------------------------------------------
void drawBars(Alarm *alrm)
{
  // У экрана будильника 2 надписи Само время (0), список дней (1)
  int x = screenCur->text[1]->x;
  int y = screenCur->text[1]->y;
  if(alarmCheckDay(alrm, Saturday))
    drawRect(x+5*7+1, y-3, x+6*7-1, y-2, RED, RED);
  if(alarmCheckDay(alrm, Sunday))
    drawRect(x+6*7+1, y-3, x+7*7-1, y-2, RED, RED);
  if(alrm->on)
    drawRect(x+7*7+2, y-3, x+9*7-1, y-2, WHITE, WHITE);

//  drawRect(2, 2, 3, 10, RED, BLUE);
  for(uint8_t i = 1; i < 6; ++i)
  {
    if(alarmCheckDay(alrm, i))
      drawRect(x+(i-1)*7+1, y-3, x+i*7-1, y-2, GREEN, GREEN);
  }

