Llerr/Clock-on-STM32/Core/Src/Screens.c
}

//----------------------------------------------------------------------------------------------------------------------
//  Понедельник - Monday - Mon или Mo
//  Вторник - Tuesday - Tue или Tu
//  Среда - Wednesday - Wed или We
//  Четверг - Thursday - Thu или Th
//  Пятница - Friday - Fri или Fr
//  Суббота - Saturday - Sat или Sa
//  Воскресенье - Sunday - Sun или Su
void drawAlarmDays(TextSets *set, void *dataPtr)
{
  UB_Font_DrawPString16(set->x,       set->y, "MTWTF", set->font, GREEN, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawAlarmOffDays(TextSets *set, void *dataPtr)
{
  UB_Font_DrawPString16(set->x, set->y,    "SS", set->font,   RED, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawAlarmOn(TextSets *set, void *dataPtr)
{
  UB_Font_DrawPString16(set->x, set->y,     "On", set->font, WHITE, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawTimer(TextSets *set, void *dataPtr)         // 7 для вывода секундомера
{
//  char buff[32];

  UB_Font_DrawPString16(set->x, set->y, "000:00.00", set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawCountdown(TextSets *set, void *dataPtr)     // 8 для вывода таймера
{
  char buff[32];
  sprintf(buff, "%02d:%02d:%02d", sCountdown.Hours, sCountdown.Minutes, sCountdown.Seconds);
  UB_Font_DrawPString32(set->x, set->y, buff, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawBrightness(TextSets *set, void *dataPtr)     // 8 для вывода таймера
{
  char buff[32];
  sprintf(buff, "%03d", curBright);
  UB_Font_DrawPString32(set->x, set->y, buff, set->font, set->colorFont, set->colorBack);
  //      UB_Font_DrawPString(0, 16, "000:00.00", &pComic_16 , 7, 0);
}

//----------------------------------------------------------------------------------------------------------------------
void drawIllumination(TextSets *set, void *dataPtr)     // 8 для вывода таймера
{
  char buff[32];
  sprintf(buff, "%d.%d         ", illumination/100, illumination%100 );
  drawPicture(0, 0,  &picBrightness);
  drawPicture(0, 16, &picIllumination);
  UB_Font_DrawPString16(set->x, set->y, buff, set->font, set->colorFont, set->colorBack);
  //      UB_Font_DrawPString(0, 16, "000:00.00", &pComic_16 , 7, 0);
}

//----------------------------------------------------------------------------------------------------------------------
void drawText(TextSets *set, void *dataPtr)
{
  //  char buff[32];
  UB_Font_DrawPString16(set->x, set->y, set->text, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawText32(TextSets *set, void *dataPtr)
{
  //  char buff[32];
  UB_Font_DrawPString32(set->x, set->y, set->text, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawMenu(TextSets *set, void *dataPtr)
{
  //  char buff[32];
  UB_Font_DrawPString16(set->x, set->y, set->text, set->font, set->colorFont, set->colorBack);
}

//----------------------------------------------------------------------------------------------------------------------
void drawEdit(TextSets *set, void *dataPtr)
{
  UB_Font_DrawPString16(set->x, set->y, set->text, set->font, set->colorFont, TRANSPARENT);
  //  blink(0);
}

//----------------------------------------------------------------------------------------------------------------------
void drawEdit32(TextSets *set, void *dataPtr)
{
  UB_Font_DrawPString32(set->x, set->y, set->text, set->font, set->colorFont, TRANSPARENT);
}

//----------------------------------------------------------------------------------------------------------------------
void drawBlink(TextSets *set, void *dataPtr)
{
  uint8_t *color = (uint8_t *)(dataPtr);
  UB_Font_DrawPString16(set->x, set->y, set->text, set->font, *color, TRANSPARENT);
}

//----------------------------------------------------------------------------------------------------------------------
void drawBlink32(TextSets *set, void *dataPtr)
{
  uint8_t *color = (uint8_t *)(dataPtr);
//  printf("%ld: blink(%s):%d\n", HAL_GetTick(), set->text, *color);
  UB_Font_DrawPString32(set->x, set->y, set->text, set->font, *color, TRANSPARENT);
}

//----------------------------------------------------------------------------------------------------------------------
//---------------------------------- Данные ----------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//                                  1+13*2
TextSets textBlinkTime =   {txtTime, 27,   -5, WHITE, BLACK, &pDigital_7_28, drawBlink, ":"}; // Двоеточие для мигания

TextSets textHour        = {txtTime,        1,    -5,  WHITE, BLACK, &pDigital_7_28, drawHour,         NULL}; // Время
TextSets textMinute      = {txtTime,        27+4, -5,  WHITE, BLACK, &pDigital_7_28, drawMinute,       NULL}; // Время
TextSets textBellOn      = {txtTime,        57,    1,  WHITE, BLACK, &pDigital_7_28, drawBellOn,       NULL}; // Время
TextSets textDateAdd     = {txtDate,        0,    19, YELLOW, BLACK, &pArial_13,     drawDateAdd,      NULL}; // Дата дополнительным полем
TextSets textTemperature = {txtTemperature, 0,    19, YELLOW, BLACK, &pArial_13,     drawTemperature,  NULL}; // температура
TextSets textHumidity    = {txtHumidity,    0,    19, YELLOW, BLACK, &pArial_13,     drawHumidity,     NULL}; // Влажность
TextSets textPressure    = {txtPressure,    0,    19, YELLOW, BLACK, &pArial_13,     drawPressure,     NULL}; // Давление
TextSets textClock       = {txtClock,      18,    19, YELLOW, BLACK, &pArial_13,     drawClock,        NULL}; // Будильник
TextSets textSleep       = {txtSleep,      20,    19, YELLOW, BLACK, &pArial_13,     drawSleep,        NULL}; // Досыпание

